vintagepc/MINI404/hw/arm/prusa/stm32_common/stm32_fdcan_regdata.h
typedef union {
	struct {
		uint32_t RXFIFO0       : 1;
		uint32_t RXFIFO1       : 1;
		uint32_t SMSG          : 1;
		uint32_t TFERR         : 1;
		uint32_t MISC          : 1;
		uint32_t BERR          : 1;
		uint32_t PERR          : 1;
		uint32_t _reserved7    :25;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_fdcan,ils);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_fdcan,ils),bits);

typedef union {
	struct {
		uint32_t EINT0         : 1; // /*!<Enable Interrupt Line 0                  */
		uint32_t EINT1         : 1; // /*!<Enable Interrupt Line 1                  */
		uint32_t _reserved2    :30;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_fdcan,ile);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_fdcan,ile),bits);

typedef union {
	struct {
		uint32_t RRFE          : 1; // /*!<Reject Remote Frames Extended            */
		uint32_t RRFS          : 1; // /*!<Reject Remote Frames Standard            */
		uint32_t ANFE          : 2; // /*!<Accept Non-matching Frames Extended      */
		uint32_t ANFS          : 2; // /*!<Accept Non-matching Frames Standard      */
		uint32_t _reserved6    : 2;
		uint32_t F1OM          : 1; // /*!<FIFO 1 operation mode                    */
		uint32_t F0OM          : 1; // /*!<FIFO 0 operation mode                    */
		uint32_t _reserved10   : 6;
		uint32_t LSS           : 5; // /*!<List Size Standard                       */
		uint32_t _reserved21   : 3;
		uint32_t LSE           : 4; // /*!<List Size Extended                       */
		uint32_t _reserved28   : 4;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_fdcan,rxgfc);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_fdcan,rxgfc),bits);

typedef union {
	struct {
		uint32_t EIDM          :29; // /*!<Extended ID Mask                         */
		uint32_t _reserved29   : 3;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_fdcan,xidam);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_fdcan,xidam),bits);

typedef union {
	struct {
		uint32_t BIDX          : 3; // /*!<Buffer Index                             */
		uint32_t _reserved3    : 3;
		uint32_t MSI           : 2; // /*!<Message Storage Indicator                */
		uint32_t FIDX          : 5; // /*!<Filter Index                             */
		uint32_t _reserved13   : 2;
		uint32_t FLST          : 1; // /*!<Filter List                              */
		uint32_t _reserved16   :16;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_fdcan,hpms);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_fdcan,hpms),bits);

typedef union {
	struct {
		uint32_t F0FL          : 4; // /*!<Rx FIFO 0 Fill Level                     */
		uint32_t _reserved4    : 4;
		uint32_t F0GI          : 2; // /*!<Rx FIFO 0 Get Index                      */
		uint32_t _reserved10   : 6;
		uint32_t F0PI          : 2; // /*!<Rx FIFO 0 Put Index                      */
		uint32_t _reserved18   : 6;
		uint32_t F0F           : 1; // /*!<Rx FIFO 0 Full                           */
		uint32_t RF0L          : 1; // /*!<Rx FIFO 0 Message Lost                   */
		uint32_t _reserved26   : 6;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_fdcan,rxf0s);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_fdcan,rxf0s),bits);

typedef union {
	struct {
		uint32_t F0AI          : 3; // /*!<Rx FIFO 0 Acknowledge Index              */
		uint32_t _reserved3    :29;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_fdcan,rxf0a);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_fdcan,rxf0a),bits);

typedef union {
	struct {
		uint32_t F1FL          : 4; // /*!<Rx FIFO 1 Fill Level                     */
		uint32_t _reserved4    : 4;
		uint32_t F1GI          : 2; // /*!<Rx FIFO 1 Get Index                      */
		uint32_t _reserved10   : 6;
		uint32_t F1PI          : 2; // /*!<Rx FIFO 1 Put Index                      */
		uint32_t _reserved18   : 6;
		uint32_t F1F           : 1; // /*!<Rx FIFO 1 Full                           */
		uint32_t RF1L          : 1; // /*!<Rx FIFO 1 Message Lost                   */
		uint32_t _reserved26   : 6;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_fdcan,rxf1s);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_fdcan,rxf1s),bits);

typedef union {
	struct {
		uint32_t F1AI          : 3; // /*!<Rx FIFO 1 Acknowledge Index              */
		uint32_t _reserved3    :29;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_fdcan,rxf1a);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_fdcan,rxf1a),bits);

typedef union {
	struct {
		uint32_t _reserved0    :24;
		uint32_t TFQM          : 1; // /*!<Tx FIFO/Queue Mode                       */
		uint32_t _reserved25   : 7;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_fdcan,txbc);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_fdcan,txbc),bits);

typedef union {
	struct {
		uint32_t TFFL          : 3; // /*!<Tx FIFO Free Level                       */
		uint32_t _reserved3    : 5;
		uint32_t TFGI          : 2; // /*!<Tx FIFO Get Index                        */
		uint32_t _reserved10   : 6;
		uint32_t TFQPI         : 2; // /*!<Tx FIFO/Queue Put Index                  */
		uint32_t _reserved18   : 3;
		uint32_t TFQF          : 1; // /*!<Tx FIFO/Queue Full                       */
		uint32_t _reserved22   :10;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_fdcan,txfqs);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_fdcan,txfqs),bits);

typedef union {
	struct {
		uint32_t TRP           : 3; // /*!<Transmission Request Pending             */
		uint32_t _reserved3    :29;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_fdcan,txbrp);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_fdcan,txbrp),bits);

typedef union {
	struct {
		uint32_t AR            : 3; // /*!<Add Request                              */
		uint32_t _reserved3    :29;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_fdcan,txbar);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_fdcan,txbar),bits);

typedef union {
	struct {
		uint32_t CR            : 3; // /*!<Cancellation Request                     */
		uint32_t _reserved3    :29;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_fdcan,txbcr);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_fdcan,txbcr),bits);

