vintagepc/MINI404/hw/arm/prusa/stm32_common/stm32_fdcan_regdata.h
typedef union {
	struct {
		uint32_t TO            : 3; // /*!<Transmission Occurred                    */
		uint32_t _reserved3    :29;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_fdcan,txbto);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_fdcan,txbto),bits);

typedef union {
	struct {
		uint32_t CF            : 3; // /*!<Cancellation Finished                    */
		uint32_t _reserved3    :29;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_fdcan,txbcf);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_fdcan,txbcf),bits);

typedef union {
	struct {
		uint32_t TIE           : 3; // /*!<Transmission Interrupt Enable            */
		uint32_t _reserved3    :29;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_fdcan,txbtie);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_fdcan,txbtie),bits);

typedef union {
	struct {
		uint32_t CFIE          : 3; // /*!<Cancellation Finished Interrupt Enable   */
		uint32_t _reserved3    :29;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_fdcan,txbcie);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_fdcan,txbcie),bits);

typedef union {
	struct {
		uint32_t EFFL          : 3; // /*!<Event FIFO Fill Level                    */
		uint32_t _reserved3    : 5;
		uint32_t EFGI          : 2; // /*!<Event FIFO Get Index                     */
		uint32_t _reserved10   : 6;
		uint32_t EFPI          : 2; // /*!<Event FIFO Put Index                     */
		uint32_t _reserved18   : 6;
		uint32_t EFF           : 1; // /*!<Event FIFO Full                          */
		uint32_t TEFL          : 1; // /*!<Tx Event FIFO Element Lost               */
		uint32_t _reserved26   : 6;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_fdcan,txefs);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_fdcan,txefs),bits);

typedef union {
	struct {
		uint32_t EFAI          : 2; // /*!<Event FIFO Acknowledge Index             */
		uint32_t _reserved2    :30;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_fdcan,txefa);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_fdcan,txefa),bits);

typedef union {
	struct {
		uint32_t PDIV          : 4; // /*!<Input Clock Divider                      */
		uint32_t _reserved4    :28;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_fdcan,ckdiv);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_fdcan,ckdiv),bits);

typedef union {
	struct {
		REGDEF_NAME(com_fdcan,crel) CREL;
		REGDEF_NAME(com_fdcan,endn) ENDN;
		uint32_t _reserved0x8;
		REGDEF_NAME(com_fdcan,dbtp) DBTP;
		REGDEF_NAME(com_fdcan,test) TEST;
		REGDEF_NAME(com_fdcan,rwd) RWD;
		REGDEF_NAME(com_fdcan,cccr) CCCR;
		REGDEF_NAME(com_fdcan,nbtp) NBTP;
		REGDEF_NAME(com_fdcan,tscc) TSCC;
		REGDEF_NAME(com_fdcan,tscv) TSCV;
		REGDEF_NAME(com_fdcan,tocc) TOCC;
		REGDEF_NAME(com_fdcan,tocv) TOCV;
		uint32_t _reserved0x30[ 4];
		REGDEF_NAME(com_fdcan,ecr) ECR;
		REGDEF_NAME(com_fdcan,psr) PSR;
		REGDEF_NAME(com_fdcan,tdcr) TDCR;
		uint32_t _reserved0x4C;
		REGDEF_NAME(com_fdcan,ir) IR;
		REGDEF_NAME(com_fdcan,ie) IE;
		REGDEF_NAME(com_fdcan,ils) ILS;
		REGDEF_NAME(com_fdcan,ile) ILE;
		uint32_t _reserved0x60[ 8];
		REGDEF_NAME(com_fdcan,rxgfc) RXGFC;
		REGDEF_NAME(com_fdcan,xidam) XIDAM;
		REGDEF_NAME(com_fdcan,hpms) HPMS;
		uint32_t _reserved0x8C;
		REGDEF_NAME(com_fdcan,rxf0s) RXF0S;
		REGDEF_NAME(com_fdcan,rxf0a) RXF0A;
		REGDEF_NAME(com_fdcan,rxf1s) RXF1S;
		REGDEF_NAME(com_fdcan,rxf1a) RXF1A;
		uint32_t _reserved0xA0[ 8];
		REGDEF_NAME(com_fdcan,txbc) TXBC;
		REGDEF_NAME(com_fdcan,txfqs) TXFQS;
		REGDEF_NAME(com_fdcan,txbrp) TXBRP;
		REGDEF_NAME(com_fdcan,txbar) TXBAR;
		REGDEF_NAME(com_fdcan,txbcr) TXBCR;
		REGDEF_NAME(com_fdcan,txbto) TXBTO;
		REGDEF_NAME(com_fdcan,txbcf) TXBCF;
		REGDEF_NAME(com_fdcan,txbtie) TXBTIE;
		REGDEF_NAME(com_fdcan,txbcie) TXBCIE;
		REGDEF_NAME(com_fdcan,txefs) TXEFS;
		REGDEF_NAME(com_fdcan,txefa) TXEFA;
		uint32_t _reserved0xEC[ 5];
		REGDEF_NAME(com_fdcan,ckdiv) CKDIV;
	} /*QEMU_PACKED*/;
	uint32_t raw[RI_END];
}  REGDEF_NAME(stm32com,fdcan);

QEMU_BUILD_BUG_MSG(sizeof(REGDEF_NAME(stm32com,fdcan)) != sizeof(uint32_t)*RI_END , "Structure Size mismatch - expected uint32[RI_END]");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,fdcan), CREL) != 0, "Offset mismatch for CREL");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,fdcan), ENDN) != 4, "Offset mismatch for ENDN");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,fdcan), DBTP) != 12, "Offset mismatch for DBTP");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,fdcan), TEST) != 16, "Offset mismatch for TEST");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,fdcan), RWD) != 20, "Offset mismatch for RWD");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,fdcan), CCCR) != 24, "Offset mismatch for CCCR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,fdcan), NBTP) != 28, "Offset mismatch for NBTP");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,fdcan), TSCC) != 32, "Offset mismatch for TSCC");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,fdcan), TSCV) != 36, "Offset mismatch for TSCV");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,fdcan), TOCC) != 40, "Offset mismatch for TOCC");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,fdcan), TOCV) != 44, "Offset mismatch for TOCV");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,fdcan), ECR) != 64, "Offset mismatch for ECR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,fdcan), PSR) != 68, "Offset mismatch for PSR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,fdcan), TDCR) != 72, "Offset mismatch for TDCR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,fdcan), IR) != 80, "Offset mismatch for IR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,fdcan), IE) != 84, "Offset mismatch for IE");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,fdcan), ILS) != 88, "Offset mismatch for ILS");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,fdcan), ILE) != 92, "Offset mismatch for ILE");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,fdcan), RXGFC) != 128, "Offset mismatch for RXGFC");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,fdcan), XIDAM) != 132, "Offset mismatch for XIDAM");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,fdcan), HPMS) != 136, "Offset mismatch for HPMS");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,fdcan), RXF0S) != 144, "Offset mismatch for RXF0S");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,fdcan), RXF0A) != 148, "Offset mismatch for RXF0A");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,fdcan), RXF1S) != 152, "Offset mismatch for RXF1S");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,fdcan), RXF1A) != 156, "Offset mismatch for RXF1A");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,fdcan), TXBC) != 192, "Offset mismatch for TXBC");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,fdcan), TXFQS) != 196, "Offset mismatch for TXFQS");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,fdcan), TXBRP) != 200, "Offset mismatch for TXBRP");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,fdcan), TXBAR) != 204, "Offset mismatch for TXBAR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,fdcan), TXBCR) != 208, "Offset mismatch for TXBCR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,fdcan), TXBTO) != 212, "Offset mismatch for TXBTO");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,fdcan), TXBCF) != 216, "Offset mismatch for TXBCF");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,fdcan), TXBTIE) != 220, "Offset mismatch for TXBTIE");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,fdcan), TXBCIE) != 224, "Offset mismatch for TXBCIE");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,fdcan), TXEFS) != 228, "Offset mismatch for TXEFS");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,fdcan), TXEFA) != 232, "Offset mismatch for TXEFA");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,fdcan), CKDIV) != 256, "Offset mismatch for CKDIV");
